openocd-org/openocd/contrib/loaders/flash/max32xxx_qspi/ctb_regs.h
/* SPDX-License-Identifier: GPL-2.0-or-later */

/***************************************************************************
 *   Copyright (C) 2016 by Maxim Integrated                                *
 *   Copyright (C) 2025-2026 Analog Devices, Inc.                          *
 ***************************************************************************/

#ifndef _CTB_REGS_H_
#define _CTB_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__ICCARM__)
#pragma system_include
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#endif
/*/ @cond */
/*
	If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I volatile const
#endif
#ifndef __O
#define __O volatile
#endif
#ifndef __R
#define __R volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     ctb
 * @defgroup    ctb_registers CTB_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the CTB Peripheral Module.
 * @details The Cryptographic Toolbox is a combination of cryptographic engines and a secure cryptographic accelerator
 * (SCA) used to provide advanced cryptographic security.
 */

/**
 * @ingroup ctb_registers
 * Structure type to access the CTB Registers.
 */
struct mxc_ctb_regs {
	__IO uint32_t crypto_ctrl; /**< <tt>\b 0x00:</tt> CTB CRYPTO_CTRL Register */
	__IO uint32_t cipher_ctrl; /**< <tt>\b 0x04:</tt> CTB CIPHER_CTRL Register */
	__IO uint32_t hash_ctrl;   /**< <tt>\b 0x08:</tt> CTB HASH_CTRL Register */
	__IO uint32_t crc_ctrl;	   /**< <tt>\b 0x0C:</tt> CTB CRC_CTRL Register */
	__IO uint32_t dma_src;	   /**< <tt>\b 0x10:</tt> CTB DMA_SRC Register */
	__IO uint32_t dma_dest;	   /**< <tt>\b 0x14:</tt> CTB DMA_DEST Register */
	__IO uint32_t dma_cnt;	   /**< <tt>\b 0x18:</tt> CTB DMA_CNT Register */
	__R uint32_t rsv_0x1c;
	__O uint32_t crypto_din[4];	 /**< <tt>\b 0x20:</tt> CTB CRYPTO_DIN Register */
	__I uint32_t crypto_dout[4]; /**< <tt>\b 0x30:</tt> CTB CRYPTO_DOUT Register */
	__IO uint32_t crc_poly;		 /**< <tt>\b 0x40:</tt> CTB CRC_POLY Register */
	__IO uint32_t crc_val;		 /**< <tt>\b 0x44:</tt> CTB CRC_VAL Register */
	__R uint32_t rsv_0x48;
	__IO uint32_t ham_ecc;		   /**< <tt>\b 0x4C:</tt> CTB HAM_ECC Register */
	__IO uint32_t cipher_init[4];  /**< <tt>\b 0x50:</tt> CTB CIPHER_INIT Register */
	__O uint32_t cipher_key[8];	   /**< <tt>\b 0x60:</tt> CTB CIPHER_KEY Register */
	__IO uint32_t hash_digest[16]; /**< <tt>\b 0x80:</tt> CTB HASH_DIGEST Register */
	__IO uint32_t hash_msg_sz[4];  /**< <tt>\b 0xC0:</tt> CTB HASH_MSG_SZ Register */
	__IO uint32_t aad_length_0;	   /**< <tt>\b 0xD0:</tt> CTB AAD_LENGTH_0 Register */
	__IO uint32_t aad_length_1;	   /**< <tt>\b 0xD4:</tt> CTB AAD_LENGTH_1 Register */
	__IO uint32_t pld_length_0;	   /**< <tt>\b 0xD8:</tt> CTB PLD_LENGTH_0 Register */
	__IO uint32_t pld_length_1;	   /**< <tt>\b 0xDC:</tt> CTB PLD_LENGTH_1 Register */
	__IO uint32_t tagmic[4];	   /**< <tt>\b 0xE0:</tt> CTB TAGMIC Register */
	__R uint32_t rsv_0xf0_0xff[4];
	__IO uint32_t sca_ctrl0;		/**< <tt>\b 0x100:</tt> CTB SCA_CTRL0 Register */
	__IO uint32_t sca_ctrl1;		/**< <tt>\b 0x104:</tt> CTB SCA_CTRL1 Register */
	__IO uint32_t sca_stat;			/**< <tt>\b 0x108:</tt> CTB SCA_STAT Register */
	__IO uint32_t sca_ppx_addr;		/**< <tt>\b 0x10C:</tt> CTB SCA_PPX_ADDR Register */
	__IO uint32_t sca_ppy_addr;		/**< <tt>\b 0x110:</tt> CTB SCA_PPY_ADDR Register */
	__IO uint32_t sca_ppz_addr;		/**< <tt>\b 0x114:</tt> CTB SCA_PPZ_ADDR Register */
	__IO uint32_t sca_pqx_addr;		/**< <tt>\b 0x118:</tt> CTB SCA_PQX_ADDR Register */
	__IO uint32_t sca_pqy_addr;		/**< <tt>\b 0x11C:</tt> CTB SCA_PQY_ADDR Register */
	__IO uint32_t sca_pqz_addr;		/**< <tt>\b 0x120:</tt> CTB SCA_PQZ_ADDR Register */
	__IO uint32_t sca_rdsa_addr;	/**< <tt>\b 0x124:</tt> CTB SCA_RDSA_ADDR Register */
	__IO uint32_t sca_res_addr;		/**< <tt>\b 0x128:</tt> CTB SCA_RES_ADDR Register */
	__IO uint32_t sca_op_buff_addr; /**< <tt>\b 0x12C:</tt> CTB SCA_OP_BUFF_ADDR Register */
	__IO uint32_t sca_moddata;		/**< <tt>\b 0x130:</tt> CTB SCA_MODDATA Register */
};

/* Register offsets for module CTB */
/**
 * @ingroup    ctb_registers
 * @defgroup   CTB_Register_Offsets Register Offsets
 * @brief      CTB Peripheral Register Offsets from the CTB Base Peripheral Address.
 * @{
 */
#define MXC_R_CTB_CRYPTO_CTRL ((uint32_t)0x00000000UL)		/**< Offset from CTB Base Address: 0x0000 */
#define MXC_R_CTB_CIPHER_CTRL ((uint32_t)0x00000004UL)		/**< Offset from CTB Base Address: 0x0004 */
#define MXC_R_CTB_HASH_CTRL ((uint32_t)0x00000008UL)		/**< Offset from CTB Base Address: 0x0008 */
#define MXC_R_CTB_CRC_CTRL ((uint32_t)0x0000000CUL)			/**< Offset from CTB Base Address: 0x000C */
#define MXC_R_CTB_DMA_SRC ((uint32_t)0x00000010UL)			/**< Offset from CTB Base Address: 0x0010 */
#define MXC_R_CTB_DMA_DEST ((uint32_t)0x00000014UL)			/**< Offset from CTB Base Address: 0x0014 */
#define MXC_R_CTB_DMA_CNT ((uint32_t)0x00000018UL)			/**< Offset from CTB Base Address: 0x0018 */
#define MXC_R_CTB_CRYPTO_DIN ((uint32_t)0x00000020UL)		/**< Offset from CTB Base Address: 0x0020 */
#define MXC_R_CTB_CRYPTO_DOUT ((uint32_t)0x00000030UL)		/**< Offset from CTB Base Address: 0x0030 */
#define MXC_R_CTB_CRC_POLY ((uint32_t)0x00000040UL)			/**< Offset from CTB Base Address: 0x0040 */
#define MXC_R_CTB_CRC_VAL ((uint32_t)0x00000044UL)			/**< Offset from CTB Base Address: 0x0044 */
#define MXC_R_CTB_HAM_ECC ((uint32_t)0x0000004CUL)			/**< Offset from CTB Base Address: 0x004C */
#define MXC_R_CTB_CIPHER_INIT ((uint32_t)0x00000050UL)		/**< Offset from CTB Base Address: 0x0050 */
#define MXC_R_CTB_CIPHER_KEY ((uint32_t)0x00000060UL)		/**< Offset from CTB Base Address: 0x0060 */
#define MXC_R_CTB_HASH_DIGEST ((uint32_t)0x00000080UL)		/**< Offset from CTB Base Address: 0x0080 */
#define MXC_R_CTB_HASH_MSG_SZ ((uint32_t)0x000000C0UL)		/**< Offset from CTB Base Address: 0x00C0 */
#define MXC_R_CTB_AAD_LENGTH_0 ((uint32_t)0x000000D0UL)		/**< Offset from CTB Base Address: 0x00D0 */
#define MXC_R_CTB_AAD_LENGTH_1 ((uint32_t)0x000000D4UL)		/**< Offset from CTB Base Address: 0x00D4 */
#define MXC_R_CTB_PLD_LENGTH_0 ((uint32_t)0x000000D8UL)		/**< Offset from CTB Base Address: 0x00D8 */
#define MXC_R_CTB_PLD_LENGTH_1 ((uint32_t)0x000000DCUL)		/**< Offset from CTB Base Address: 0x00DC */
#define MXC_R_CTB_TAGMIC ((uint32_t)0x000000E0UL)			/**< Offset from CTB Base Address: 0x00E0 */
#define MXC_R_CTB_SCA_CTRL0 ((uint32_t)0x00000100UL)		/**< Offset from CTB Base Address: 0x0100 */
#define MXC_R_CTB_SCA_CTRL1 ((uint32_t)0x00000104UL)		/**< Offset from CTB Base Address: 0x0104 */
#define MXC_R_CTB_SCA_STAT ((uint32_t)0x00000108UL)			/**< Offset from CTB Base Address: 0x0108 */
#define MXC_R_CTB_SCA_PPX_ADDR ((uint32_t)0x0000010CUL)		/**< Offset from CTB Base Address: 0x010C */
#define MXC_R_CTB_SCA_PPY_ADDR ((uint32_t)0x00000110UL)		/**< Offset from CTB Base Address: 0x0110 */
#define MXC_R_CTB_SCA_PPZ_ADDR ((uint32_t)0x00000114UL)		/**< Offset from CTB Base Address: 0x0114 */
#define MXC_R_CTB_SCA_PQX_ADDR ((uint32_t)0x00000118UL)		/**< Offset from CTB Base Address: 0x0118 */
#define MXC_R_CTB_SCA_PQY_ADDR ((uint32_t)0x0000011CUL)		/**< Offset from CTB Base Address: 0x011C */
#define MXC_R_CTB_SCA_PQZ_ADDR ((uint32_t)0x00000120UL)		/**< Offset from CTB Base Address: 0x0120 */
#define MXC_R_CTB_SCA_RDSA_ADDR ((uint32_t)0x00000124UL)	/**< Offset from CTB Base Address: 0x0124 */
#define MXC_R_CTB_SCA_RES_ADDR ((uint32_t)0x00000128UL)		/**< Offset from CTB Base Address: 0x0128 */
#define MXC_R_CTB_SCA_OP_BUFF_ADDR ((uint32_t)0x0000012CUL) /**< Offset from CTB Base Address: 0x012C */
#define MXC_R_CTB_SCA_MODDATA ((uint32_t)0x00000130UL)		/**< Offset from CTB Base Address: 0x0130 */
															/**@} end of group ctb_registers */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_CRYPTO_CTRL CTB_CRYPTO_CTRL
 * @brief    Crypto Control Register.
 * @{
 */
#define MXC_F_CTB_CRYPTO_CTRL_RST_POS 0												   /**< CRYPTO_CTRL_RST Position */
#define MXC_F_CTB_CRYPTO_CTRL_RST ((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_RST_POS)) /**< CRYPTO_CTRL_RST Mask */

#define MXC_F_CTB_CRYPTO_CTRL_INTR_POS 1 /**< CRYPTO_CTRL_INTR Position */
#define MXC_F_CTB_CRYPTO_CTRL_INTR ((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_INTR_POS)) /**< CRYPTO_CTRL_INTR Mask */

#define MXC_F_CTB_CRYPTO_CTRL_SRC_POS 2												   /**< CRYPTO_CTRL_SRC Position */
#define MXC_F_CTB_CRYPTO_CTRL_SRC ((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_SRC_POS)) /**< CRYPTO_CTRL_SRC Mask */

#define MXC_F_CTB_CRYPTO_CTRL_BSO_POS 4												   /**< CRYPTO_CTRL_BSO Position */
#define MXC_F_CTB_CRYPTO_CTRL_BSO ((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_BSO_POS)) /**< CRYPTO_CTRL_BSO Mask */

#define MXC_F_CTB_CRYPTO_CTRL_BSI_POS 5												   /**< CRYPTO_CTRL_BSI Position */
#define MXC_F_CTB_CRYPTO_CTRL_BSI ((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_BSI_POS)) /**< CRYPTO_CTRL_BSI Mask */

#define MXC_F_CTB_CRYPTO_CTRL_WAIT_EN_POS 6 /**< CRYPTO_CTRL_WAIT_EN Position */
#define MXC_F_CTB_CRYPTO_CTRL_WAIT_EN                                                                                  \
	((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_WAIT_EN_POS)) /**< CRYPTO_CTRL_WAIT_EN Mask */

#define MXC_F_CTB_CRYPTO_CTRL_WAIT_POL_POS 7 /**< CRYPTO_CTRL_WAIT_POL Position */
#define MXC_F_CTB_CRYPTO_CTRL_WAIT_POL                                                                                 \
	((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_WAIT_POL_POS)) /**< CRYPTO_CTRL_WAIT_POL Mask */

#define MXC_F_CTB_CRYPTO_CTRL_WRSRC_POS 8 /**< CRYPTO_CTRL_WRSRC Position */
#define MXC_F_CTB_CRYPTO_CTRL_WRSRC                                                                                    \
	((uint32_t)(0x3UL << MXC_F_CTB_CRYPTO_CTRL_WRSRC_POS)) /**< CRYPTO_CTRL_WRSRC Mask */
#define MXC_V_CTB_CRYPTO_CTRL_WRSRC_NONE ((uint32_t)0x0UL) /**< CRYPTO_CTRL_WRSRC_NONE Value */
#define MXC_S_CTB_CRYPTO_CTRL_WRSRC_NONE                                                                               \
	(MXC_V_CTB_CRYPTO_CTRL_WRSRC_NONE << MXC_F_CTB_CRYPTO_CTRL_WRSRC_POS) /**< CRYPTO_CTRL_WRSRC_NONE Setting */
#define MXC_V_CTB_CRYPTO_CTRL_WRSRC_CIPHEROUTPUT ((uint32_t)0x1UL)		  /**< CRYPTO_CTRL_WRSRC_CIPHEROUTPUT Value */
#define MXC_S_CTB_CRYPTO_CTRL_WRSRC_CIPHEROUTPUT                                                                       \
	(MXC_V_CTB_CRYPTO_CTRL_WRSRC_CIPHEROUTPUT                                                                          \
	 << MXC_F_CTB_CRYPTO_CTRL_WRSRC_POS)					   /**< CRYPTO_CTRL_WRSRC_CIPHEROUTPUT Setting */
#define MXC_V_CTB_CRYPTO_CTRL_WRSRC_READFIFO ((uint32_t)0x2UL) /**< CRYPTO_CTRL_WRSRC_READFIFO Value */
#define MXC_S_CTB_CRYPTO_CTRL_WRSRC_READFIFO                                                                           \
	(MXC_V_CTB_CRYPTO_CTRL_WRSRC_READFIFO << MXC_F_CTB_CRYPTO_CTRL_WRSRC_POS) /**< CRYPTO_CTRL_WRSRC_READFIFO Setting  \
																			   */

#define MXC_F_CTB_CRYPTO_CTRL_RDSRC_POS 10 /**< CRYPTO_CTRL_RDSRC Position */
#define MXC_F_CTB_CRYPTO_CTRL_RDSRC                                                                                    \
	((uint32_t)(0x3UL << MXC_F_CTB_CRYPTO_CTRL_RDSRC_POS))		  /**< CRYPTO_CTRL_RDSRC Mask */
#define MXC_V_CTB_CRYPTO_CTRL_RDSRC_DMADISABLED ((uint32_t)0x0UL) /**< CRYPTO_CTRL_RDSRC_DMADISABLED Value */
#define MXC_S_CTB_CRYPTO_CTRL_RDSRC_DMADISABLED                                                                        \
	(MXC_V_CTB_CRYPTO_CTRL_RDSRC_DMADISABLED                                                                           \
	 << MXC_F_CTB_CRYPTO_CTRL_RDSRC_POS)					   /**< CRYPTO_CTRL_RDSRC_DMADISABLED Setting */
#define MXC_V_CTB_CRYPTO_CTRL_RDSRC_DMAORAPB ((uint32_t)0x1UL) /**< CRYPTO_CTRL_RDSRC_DMAORAPB Value */
#define MXC_S_CTB_CRYPTO_CTRL_RDSRC_DMAORAPB                                                                           \
	(MXC_V_CTB_CRYPTO_CTRL_RDSRC_DMAORAPB << MXC_F_CTB_CRYPTO_CTRL_RDSRC_POS) /**< CRYPTO_CTRL_RDSRC_DMAORAPB Setting  \
																			   */
#define MXC_V_CTB_CRYPTO_CTRL_RDSRC_RNG ((uint32_t)0x2UL)					  /**< CRYPTO_CTRL_RDSRC_RNG Value */
#define MXC_S_CTB_CRYPTO_CTRL_RDSRC_RNG                                                                                \
	(MXC_V_CTB_CRYPTO_CTRL_RDSRC_RNG << MXC_F_CTB_CRYPTO_CTRL_RDSRC_POS) /**< CRYPTO_CTRL_RDSRC_RNG Setting */

#define MXC_F_CTB_CRYPTO_CTRL_FLAG_MODE_POS 14 /**< CRYPTO_CTRL_FLAG_MODE Position */
#define MXC_F_CTB_CRYPTO_CTRL_FLAG_MODE                                                                                \
	((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_FLAG_MODE_POS)) /**< CRYPTO_CTRL_FLAG_MODE Mask */

#define MXC_F_CTB_CRYPTO_CTRL_DMADNEMSK_POS 15 /**< CRYPTO_CTRL_DMADNEMSK Position */
#define MXC_F_CTB_CRYPTO_CTRL_DMADNEMSK                                                                                \
	((uint32_t)(0x1UL << MXC_F_CTB_CRYPTO_CTRL_DMADNEMSK_POS)) /**< CRYPTO_CTRL_DMADNEMSK Mask */

